MESSAGES = {'START': '''<b>👋 Здравствуйте! Я мед-бот, способный дать рекомендации по вашему здоровью. Буду рад ответить на Ваши вопросы, касающиеся медицинских тем. Пожалуйста, выберите команду из клавиатуры для продолжения работы, либо выберите команду из меню для большей информации.
    
❗ Напоминаю, что я не заменяю врача, а лишь оказываю для Вас информационную услугу. Консультации строго анонимны, история переписки, после завершения диалога, не сохраняется и остаётся только в Вашем диалоговом окне.</b>''',
            'ERROR': '''Извините, но я не могу ответить на этот вопрос. Я готов помочь вам с медицинскими вопросами и рекомендациями по здоровью. Если у вас есть какие-либо вопросы в этой области, пожалуйста, задайте их, и я с удовольствием помогу вам.''',
            'NEW_INSULT_IND': ['Что-то в вашем вопросе меня смущает. Может, поговорим на другую тему?',
                               'Не люблю менять тему разговора, но вот сейчас тот самый случай.',
                               'Как у нейросетевой языковой модели у меня не может быть настроения, но почему-то я совсем не хочу говорить на эту тему.'],
            'START_PLACE': 'Вы вернулись в начало.',
            'START_DIALOG': 'Хорошо, давайте посмотрим на ваши симптомы. Расскажите, что вас беспокоит?',
            'DIALOG_CHOICE': '''
            
1 - продолжить диалог
2 - покинуть диалог
            ''',
            'PUT_HR': '''Введите только значение значение пульса без лишних символов
            
*Для взрослого человека норма составляет 60-80 биений в минуту''',
            'ERROR_HR': 'Значение введено некорректно.',
            'HR_CHOICE': '''
            
1 - попробовать еще раз
2 - вернуться в главное меню
            ''',
            'PUT_HR_SUCCESSFULLY': '''
            
1 - загрузить пульс еще раз
2 - вернуться в главное меню           
            ''',
            'CHECK_HR_SECTION': '''В этом разделе ты можешь отследить свой пульс за определенный день или за период.\n\n1️⃣ - Посмотреть пульс за определенный день\n📅 - Посмотреть среднее, максимальное и минимальное значение пульса за период
        ''',
            'CHECK_ONE_DAY_HR': 'Хорошо, введите дату, за которую хотите просмотреть пульс. Используйте следующие формат: DD.MM.YYYY\nПример: 00.00.2000',
            'CHOOSE_AGR_FUNC': 'Выберите, за какой период хотите просмотреть значение',
            'START_DATE': 'Введите <b>начальную</b> дату диапазона. Используйте следующие формат: DD.MM.YYYY\nПример: 00.00.2000',
            'END_DATE': 'Хорошо, теперь введите <b>конечную</b> дату диапазона. Используйте следующие формат: DD.MM.YYYY\nПример: 00.00.2000',
            'SUPPORT': 'С помощью команды /start_menu вы в любой момент можете вернуться в начало.\n\nЕсли возникнут вопросы по работе мед-бота, пишите администратору @Fedya_1717.',
            'FEEDBACK': 'По этой ссылке вы можете оставить отзыв о работе бота 🙂\nhttps://t.me/+jUptfzYIVUNmMTIy'
            }
